In [25]:
import pandas as pd
import numpy as np

In [26]:
groceries = pd.Series(data=[10,12,14,16],index=['eggs','apple','onion','bread'])

In [27]:
groceries

eggs     10
apple    12
onion    14
bread    16
dtype: int64

print(groceries)

In [28]:
groceries.ndim

1

In [29]:
groceries.shape

(4,)

In [30]:
groceries.size

4

In [31]:
'eggs' in groceries

True

In [32]:
groceries[-1]

16

In [33]:
groceries[1]

12

In [34]:
groceries[[0,1]]

eggs     10
apple    12
dtype: int64

In [35]:
groceries.iloc[[0,1]]

eggs     10
apple    12
dtype: int64

In [36]:
groceries['eggs'] = 14

In [37]:
groceries

eggs     14
apple    12
onion    14
bread    16
dtype: int64

In [38]:
groceries.drop('eggs')

apple    12
onion    14
bread    16
dtype: int64

In [39]:
groceries/2

eggs     7.0
apple    6.0
onion    7.0
bread    8.0
dtype: float64

In [40]:
groceries+2

eggs     16
apple    14
onion    16
bread    18
dtype: int64

In [41]:
groceries * 2

eggs     28
apple    24
onion    28
bread    32
dtype: int64

In [42]:
np.sqrt(groceries)

eggs     3.741657
apple    3.464102
onion    3.741657
bread    4.000000
dtype: float64

In [43]:
np.power(groceries,2)

eggs     196
apple    144
onion    196
bread    256
dtype: int64

In [44]:
np.exp(groceries)

eggs     1.202604e+06
apple    1.627548e+05
onion    1.202604e+06
bread    8.886111e+06
dtype: float64

In [45]:
groceries.iloc[2] + 2

16

In [46]:
distance_from_sun = [149.6, 1433.5, 227.9, 108.2, 778.6]

planets = ['Earth','Saturn', 'Mars','Venus', 'Jupiter']
dist_planets = pd.Series(distance_from_sun,planets)

In [47]:
dist_planets

Earth       149.6
Saturn     1433.5
Mars        227.9
Venus       108.2
Jupiter     778.6
dtype: float64

In [48]:
time_light = dist_planets /18

In [51]:
time_light[time_light >40]

Saturn     79.638889
Jupiter    43.255556
dtype: float64

In [54]:
items = {
    'Bob': pd.Series([14,18,12],['meat','bacon','bread']),
    'Ron': pd.Series([14,18,12],['meat','bacon','bread'])
}

In [55]:
shopping_cart = pd.DataFrame(items)

In [56]:
shopping_cart

       Bob  Ron
meat    14   14
bacon   18   18
bread   12   12

In [57]:
shopping_cart.ndim

2

In [58]:
shopping_cart.size

6

In [59]:
shopping_cart.shape

(3, 2)

In [60]:
shopping_cart.values

array([[14, 14],
       [18, 18],
       [12, 12]])

In [61]:
shopping_cart.index

Index(['meat', 'bacon', 'bread'], dtype='object')

In [64]:
bob_shopping_cart = pd.DataFrame(items,columns=['Bob'])

In [65]:
bob_shopping_cart

       Bob
meat    14
bacon   18
bread   12

In [66]:
data = {'Integers' : [1,2,3],
        'Floats' : [4.5, 8.2, 9.6]}

In [67]:
df = pd.DataFrame(data)

In [68]:
df

   Integers  Floats
0         1     4.5
1         2     8.2
2         3     9.6

In [70]:
items2 = [{'bikes': 20, 'pants': 30, 'watches': 35}, 
          {'watches': 10, 'glasses': 50, 'bikes': 15, 'pants':5}]

In [74]:
pd.DataFrame(items2,index=['store1','store2'])

        bikes  glasses  pants  watches
store1     20      NaN     30       35
store2     15     50.0      5       10

In [76]:
store_items = pd.DataFrame(items2,index=['store1','store2'])

In [77]:
store_items

        bikes  glasses  pants  watches
store1     20      NaN     30       35
store2     15     50.0      5       10

In [78]:
store_items[['bikes']]

        bikes
store1     20
store2     15

In [79]:
store_items[['bikes', 'pants']]

        bikes  pants
store1     20     30
store2     15      5

In [81]:
 store_items.loc[['store1']]

        bikes  glasses  pants  watches
store1     20      NaN     30       35

In [82]:
store_items['bikes']['store2']

15

In [83]:
store_items['shirts'] = [15,2]

In [84]:
store_items

        bikes  glasses  pants  watches  shirts
store1     20      NaN     30       35      15
store2     15     50.0      5       10       2

In [85]:
store_items['suits'] = store_items['pants'] + store_items['shirts']

In [86]:
store_items

        bikes  glasses  pants  watches  shirts  suits
store1     20      NaN     30       35      15     45
store2     15     50.0      5       10       2      7

In [87]:
new_items = [{'bikes': 20, 'pants': 30, 'watches': 35, 'glasses': 4}]

In [88]:
new_store = pd.DataFrame(new_items,index=['store3'])

In [89]:
store_items = store_items.append(new_store)

/home/troy/anaconda3/lib/python3.6/site-packages/pandas/core/frame.py:6201: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=True'.

To retain the current behavior and silence the warning, pass sort=False

  sort=sort)

In [90]:
store_items

        bikes  glasses  pants  shirts  suits  watches
store1     20      NaN     30    15.0   45.0       35
store2     15     50.0      5     2.0    7.0       10
store3     20      4.0     30     NaN    NaN       35

In [91]:
store_items['new watches'] = store_items['watches'][1:]

In [92]:
store_items

        bikes  glasses  pants  shirts  suits  watches  new watches
store1     20      NaN     30    15.0   45.0       35          NaN
store2     15     50.0      5     2.0    7.0       10         10.0
store3     20      4.0     30     NaN    NaN       35         35.0

In [93]:
store_items.insert(4,'shoes',[8,5,0])

In [94]:
store_items

        bikes  glasses  pants  shirts  shoes  suits  watches  new watches
store1     20      NaN     30    15.0      8   45.0       35          NaN
store2     15     50.0      5     2.0      5    7.0       10         10.0
store3     20      4.0     30     NaN      0    NaN       35         35.0

In [95]:
store_items.pop('new watches')

store1     NaN
store2    10.0
store3    35.0
Name: new watches, dtype: float64

In [96]:
store_items

        bikes  glasses  pants  shirts  shoes  suits  watches
store1     20      NaN     30    15.0      8   45.0       35
store2     15     50.0      5     2.0      5    7.0       10
store3     20      4.0     30     NaN      0    NaN       35

In [97]:
store_items.drop(['store1','store2'],axis=0)

        bikes  glasses  pants  shirts  shoes  suits  watches
store3     20      4.0     30     NaN      0    NaN       35

In [99]:
store_items.drop(['pants','shoes'],axis=1)

        bikes  glasses  shirts  suits  watches
store1     20      NaN    15.0   45.0       35
store2     15     50.0     2.0    7.0       10
store3     20      4.0     NaN    NaN       35

In [101]:
store_items.rename(columns={'bikes':'hats'})

        hats  glasses  pants  shirts  shoes  suits  watches
store1    20      NaN     30    15.0      8   45.0       35
store2    15     50.0      5     2.0      5    7.0       10
store3    20      4.0     30     NaN      0    NaN       35

In [102]:
store_items.rename(index={'store3':'last'})

        bikes  glasses  pants  shirts  shoes  suits  watches
store1     20      NaN     30    15.0      8   45.0       35
store2     15     50.0      5     2.0      5    7.0       10
last       20      4.0     30     NaN      0    NaN       35

In [103]:
store_items = store_items.set_index('pants')

In [104]:
items2 = [{'bikes': 20, 'pants': 30, 'watches': 35, 'shirts': 15, 'shoes':8, 'suits':45},
{'watches': 10, 'glasses': 50, 'bikes': 15, 'pants':5, 'shirts': 2, 'shoes':5, 'suits':7},
{'bikes': 20, 'pants': 30, 'watches': 35, 'glasses': 4, 'shoes':10}]

In [105]:
store_items = pd.DataFrame(items2, index = ['store 1', 'store 2', 'store 3'])

In [106]:
store_items

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1     20      NaN     30    15.0      8   45.0       35
store 2     15     50.0      5     2.0      5    7.0       10
store 3     20      4.0     30     NaN     10    NaN       35

In [108]:
store_items.isnull().sum()

bikes      0
glasses    1
pants      0
shirts     1
shoes      0
suits      1
watches    0
dtype: int64

In [109]:
store_items.isnull().sum().sum()

3

In [110]:
store_items.dropna(axis=0)

         bikes  glasses  pants  shirts  shoes  suits  watches
store 2     15     50.0      5     2.0      5    7.0       10

In [111]:
store_items.dropna(axis=1)

         bikes  pants  shoes  watches
store 1     20     30      8       35
store 2     15      5      5       10
store 3     20     30     10       35

In [112]:
store_items.fillna(0)

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1     20      0.0     30    15.0      8   45.0       35
store 2     15     50.0      5     2.0      5    7.0       10
store 3     20      4.0     30     0.0     10    0.0       35

In [113]:
store_items

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1     20      NaN     30    15.0      8   45.0       35
store 2     15     50.0      5     2.0      5    7.0       10
store 3     20      4.0     30     NaN     10    NaN       35

In [114]:
store_items.fillna(method="ffill",axis=1)

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1   20.0     20.0   30.0    15.0    8.0   45.0     35.0
store 2   15.0     50.0    5.0     2.0    5.0    7.0     10.0
store 3   20.0      4.0   30.0    30.0   10.0   10.0     35.0

In [115]:
store_items

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1     20      NaN     30    15.0      8   45.0       35
store 2     15     50.0      5     2.0      5    7.0       10
store 3     20      4.0     30     NaN     10    NaN       35

In [116]:
store_items.fillna(method="backfill",axis=1)

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1   20.0     30.0   30.0    15.0    8.0   45.0     35.0
store 2   15.0     50.0    5.0     2.0    5.0    7.0     10.0
store 3   20.0      4.0   30.0    10.0   10.0   35.0     35.0

In [117]:
store_items.interpolate(method="linear",axis=1)

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1   20.0     25.0   30.0    15.0    8.0   45.0     35.0
store 2   15.0     50.0    5.0     2.0    5.0    7.0     10.0
store 3   20.0      4.0   30.0    20.0   10.0   22.5     35.0

In [118]:
store_items.interpolate(method="linear",axis=1)

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1   20.0     25.0   30.0    15.0    8.0   45.0     35.0
store 2   15.0     50.0    5.0     2.0    5.0    7.0     10.0
store 3   20.0      4.0   30.0    20.0   10.0   22.5     35.0

In [136]:
book_ratings = pd.DataFrame({'books':books,'authors':authors, 'User 1': user_1,
    'User 2': user_2,
    'User 3': user_3,
    'User 4': user_4,})

In [137]:
book_ratings

                 books              authors  User 1  User 2  User 3  User 4
0   Great Expectations      Charles Dickens     3.2     5.0     2.0     4.0
1      Of Mice and Men       John Steinbeck     NaN     1.3     2.3     3.5
2     Romeo and Juliet  William Shakespeare     2.5     4.0     NaN     4.0
3     The Time Machine          H. G. Wells     NaN     3.8     4.0     5.0
4  Alice in Wonderland        Lewis Carroll     NaN     NaN     NaN     4.2

In [142]:
book_ratings[book_ratings==5].any(axis=1)

0     True
1    False
2    False
3     True
4    False
dtype: bool

In [147]:
book_ratings.fillna(book_ratings.mean())

                 books              authors  User 1  User 2    User 3  User 4
0   Great Expectations      Charles Dickens    3.20   5.000  2.000000     4.0
1      Of Mice and Men       John Steinbeck    2.85   1.300  2.300000     3.5
2     Romeo and Juliet  William Shakespeare    2.50   4.000  2.766667     4.0
3     The Time Machine          H. G. Wells    2.85   3.800  4.000000     5.0
4  Alice in Wonderland        Lewis Carroll    2.85   3.525  2.766667     4.2

In [148]:
Google_stock = pd.read_csv('./goog.csv')

In [149]:
Google_stock

       Sym       Date    Open    High     Low   Close    Volume  Adj Close
0     GOOG   4/7/2010  567.30  568.75  561.86  563.54   2581000     563.54
1     GOOG   4/6/2010  569.46  570.89  565.40  568.22   2060100     568.22
2     GOOG   4/5/2010  570.90  574.88  569.00  571.01   1901500     571.01
3     GOOG   4/1/2010  571.35  573.45  565.55  568.80   2102700     568.80
4     GOOG  3/31/2010  565.05  569.74  562.81  567.12   3030800     567.12
5     GOOG  3/30/2010  562.83  567.63  560.28  566.71   1977900     566.71
6     GOOG  3/29/2010  563.00  564.72  560.57  562.45   3104500     562.45
7     GOOG  3/26/2010  565.27  567.39  560.02  562.69   2696200     562.69
8     GOOG  3/25/2010  559.02  572.00  558.66  562.88   3930900     562.88
9     GOOG  3/24/2010  545.51  559.85  539.70  557.33   6565200     557.33
10    GOOG  3/23/2010  557.04  558.31  542.00  549.00   5501300     549.00
11    GOOG  3/22/2010  556.11  566.85  554.28  557.50   4004800     557.50
12    GOOG  3/19/2010  566.23  568.00  557.28  560.00   4792400     560.00
13    GOOG  3/18/2010  564.72  568.44  562.96  566.40   1777200     566.40
14    GOOG  3/17/2010  568.30  571.45  564.25  565.56   3321600     565.56
15    GOOG  3/16/2010  561.83  568.42  560.76  565.20   3431500     565.20
16    GOOG  3/15/2010  566.68  569.45  556.00  563.18   4653900     563.18
17    GOOG  3/12/2010  588.14  588.28  579.16  579.54   2753400     579.54
18    GOOG  3/11/2010  574.26  586.21  574.20  581.14   4233300     581.14
19    GOOG  3/10/2010  563.76  578.50  562.21  576.45   5654900     576.45
20    GOOG   3/9/2010  559.85  564.66  556.50  560.19   3176600     560.19
21    GOOG   3/8/2010  564.78  565.18  561.01  562.48   2386400     562.48
22    GOOG   3/5/2010  561.35  567.67  559.90  564.21   3912200     564.21
23    GOOG   3/4/2010  546.50  556.13  546.20  554.59   3183800     554.59
24    GOOG   3/3/2010  542.36  548.12  539.25  545.32   3089400     545.32
25    GOOG   3/2/2010  535.48  545.66  535.01  541.06   4356800     541.06
26    GOOG   3/1/2010  529.20  533.29  527.74  532.69   2237900     532.69
27    GOOG  2/26/2010  527.42  531.75  523.48  526.80   2049300     526.80
28    GOOG  2/25/2010  527.12  528.49  520.00  526.43   3309200     526.43
29    GOOG  2/24/2010  533.98  538.44  530.51  531.47   2326600     531.47
...    ...        ...     ...     ...     ...     ...       ...        ...
1228  GOOG  5/19/2005  240.34  241.17  238.27  239.18   9716500     239.18
1229  GOOG  5/18/2005  233.61  239.97  233.52  239.16  12312000     239.16
1230  GOOG  5/17/2005  230.56  233.45  230.20  233.13   7808900     233.13
1231  GOOG  5/16/2005  229.68  231.62  228.57  231.05   5681400     231.05
1232  GOOG  5/13/2005  229.18  231.09  227.32  229.24   7415500     229.24
1233  GOOG  5/12/2005  230.81  232.23  228.20  228.72   8948200     228.72
1234  GOOG  5/11/2005  228.97  231.98  227.93  231.29  11478800     231.29
1235  GOOG  5/10/2005  225.47  227.80  224.72  227.80   6345800     227.80
1236  GOOG   5/9/2005  228.00  228.50  225.43  226.02   5536800     226.02
1237  GOOG   5/6/2005  228.40  229.25  226.47  228.02   6763900     228.02
1238  GOOG   5/5/2005  228.62  228.62  225.88  226.98   7509600     226.98
1239  GOOG   5/4/2005  227.23  229.88  227.00  228.50  12083500     228.50
1240  GOOG   5/3/2005  221.85  228.15  221.32  226.19  17780200     226.19
1241  GOOG   5/2/2005  222.05  223.70  220.21  222.29   9767400     222.29
1242  GOOG  4/29/2005  221.91  222.25  217.82  220.00   9170200     220.00
1243  GOOG  4/28/2005  219.50  222.08  217.71  219.45   8682800     219.45
1244  GOOG  4/27/2005  217.99  220.85  216.74  219.78  10264800     219.78
1245  GOOG  4/26/2005  220.22  222.00  218.29  218.75  17272000     218.75
1246  GOOG  4/25/2005  217.82  224.74  217.52  223.53  19840000     223.53
1247  GOOG  4/22/2005  222.90  224.00  214.26  215.81  33205100     215.81
1248  GOOG  4/21/2005  200.42  205.00  199.32  204.22  17751900     204.22
1249  GOOG  4/20/2005  198.58  200.50  195.91  198.10  15451500     198.10
1250  GOOG  4/19/2005  189.33  192.00  188.03  191.40   8430000     191.40
1251  GOOG  4/18/2005  184.58  187.88  183.49  186.97   6550300     186.97
1252  GOOG  4/15/2005  190.10  190.34  184.66  185.00  11577400     185.00
1253  GOOG  4/14/2005  193.27  194.36  190.10  191.45   6152700     191.45
1254  GOOG  4/13/2005  193.47  194.32  189.73  192.93   6555800     192.93
1255  GOOG  4/12/2005  193.00  194.42  189.41  193.96   7319600     193.96
1256  GOOG  4/11/2005  193.09  194.80  192.32  193.23   5410500     193.23
1257  GOOG   4/8/2005  193.69  195.10  191.45  192.05   5116600     192.05

[1258 rows x 8 columns]

In [150]:
type(Google_stock)

pandas.core.frame.DataFrame

In [151]:
Google_stock.shape

(1258, 8)

In [152]:
Google_stock.head()

    Sym       Date    Open    High     Low   Close   Volume  Adj Close
0  GOOG   4/7/2010  567.30  568.75  561.86  563.54  2581000     563.54
1  GOOG   4/6/2010  569.46  570.89  565.40  568.22  2060100     568.22
2  GOOG   4/5/2010  570.90  574.88  569.00  571.01  1901500     571.01
3  GOOG   4/1/2010  571.35  573.45  565.55  568.80  2102700     568.80
4  GOOG  3/31/2010  565.05  569.74  562.81  567.12  3030800     567.12

In [153]:
Google_stock.tail()

       Sym       Date    Open    High     Low   Close   Volume  Adj Close
1253  GOOG  4/14/2005  193.27  194.36  190.10  191.45  6152700     191.45
1254  GOOG  4/13/2005  193.47  194.32  189.73  192.93  6555800     192.93
1255  GOOG  4/12/2005  193.00  194.42  189.41  193.96  7319600     193.96
1256  GOOG  4/11/2005  193.09  194.80  192.32  193.23  5410500     193.23
1257  GOOG   4/8/2005  193.69  195.10  191.45  192.05  5116600     192.05

In [154]:
Google_stock.isnull().any()

Sym          False
Date         False
Open         False
High         False
Low          False
Close        False
Volume       False
Adj Close    False
dtype: bool

In [155]:
Google_stock.describe()

,Open,High,Low,Close,Volume,Adj Close
count,1258.000000,1258.000000,1258.000000,1258.000000,1.258000e+03,1258.000000
mean,446.004921,451.368219,440.065882,445.695779,6.492043e+06,445.695779
std,107.252863,107.588823,106.320282,106.916954,4.485054e+06,106.916954
min,184.580000,187.880000,183.490000,185.000000,8.587000e+05,185.000000
25%,374.730000,380.707500,369.230000,374.260000,3.636450e+06,374.260000
50%,447.580000,453.330000,441.910000,445.915000,5.473650e+06,445.915000
75%,519.257500,523.595000,513.030000,517.952500,7.887375e+06,517.952500
max,741.130000,747.240000,725.000000,741.790000,4.111670e+07,741.790000

In [156]:
Google_stock['Adj Close'].describe()

count    1258.000000
mean      445.695779
std       106.916954
min       185.000000
25%       374.260000
50%       445.915000
75%       517.952500
max       741.790000
Name: Adj Close, dtype: float64

In [157]:
Google_stock.mean()

Open         4.460049e+02
High         4.513682e+02
Low          4.400659e+02
Close        4.456958e+02
Volume       6.492043e+06
Adj Close    4.456958e+02
dtype: float64

In [158]:
Google_stock.max()

Sym              GOOG
Date         9/9/2009
Open           741.13
High           747.24
Low               725
Close          741.79
Volume       41116700
Adj Close      741.79
dtype: object

In [159]:
Google_stock.min()

Sym               GOOG
Date         1/10/2006
Open            184.58
High            187.88
Low             183.49
Close              185
Volume          858700
Adj Close          185
dtype: object

In [162]:
Google_stock.corr()

               Open      High       Low     Close    Volume  Adj Close
Open       1.000000  0.998883  0.998366  0.997280 -0.339888   0.997280
High       0.998883  1.000000  0.998048  0.998610 -0.331654   0.998610
Low        0.998366  0.998048  1.000000  0.998825 -0.357460   0.998825
Close      0.997280  0.998610  0.998825  1.000000 -0.344796   1.000000
Volume    -0.339888 -0.331654 -0.357460 -0.344796  1.000000  -0.344796
Adj Close  0.997280  0.998610  0.998825  1.000000 -0.344796   1.000000

In [163]:
data = pd.read_csv('./fake_company.csv')

In [164]:
data

   Year     Name Department  Age  Salary\t
0  1990    Alice         HR   25     50000
1  1990      Bob         RD   30     48000
2  1990  Charlie      Admin   45     55000
3  1991    Alice         HR   26     52000
4  1991      Bob         RD   31     50000
5  1991  Charlie      Admin   46     60000
6  1992    Alice         HR   27     60000
7  1992      Bob         RD   32     52000
8  1992  Charlie      Admin   47     62000

In [171]:
data.groupby(['Name'])['Salary'].sum()

KeyError: 'Column not found: Salary'

In [174]:
data.groupby(['Name']).sum()

         Year  Age  Salary\t
Name
Alice    5973   78    162000
Bob      5973   93    150000
Charlie  5973  138    177000

In [175]:
data.groupby(['Year','Department']).sum()

                 Age  Salary\t
Year Department
1990 Admin        45     55000
     HR           25     50000
     RD           30     48000
1991 Admin        46     60000
     HR           26     52000
     RD           31     50000
1992 Admin        47     62000
     HR           27     60000
     RD           32     52000

In [1]:
ls

NameError: name 'ls' is not defined

In [2]:

!ls

 fake_company.csv		      numpy-practise.ipynb
 goog.csv			      pandas.ipynb
 IMG_20160317_110918_1587209718.jpg   pokemon.csv
'matplotlib  and seaborn.ipynb'